# Data Frame - Table

## Series - Row-Column

In [18]:
import numpy as np
import pandas as pd

In [3]:
a = ["inder","preet" , "preety"]

In [4]:
a

['inder', 'preet', 'preety']

In [8]:
a =pd.DataFrame(a)

In [9]:
a

        0
0   inder
1   preet
2  preety

In [7]:
b = ["inder","preet" , "preety"]

In [11]:
b= pd.DataFrame(b,index = ["A","B","C"] , columns = ["Students"])

In [13]:
#row = Indexs.. column 
b

  Students
A    inder
B    preet
C   preety

In [14]:
type(b)

pandas.core.frame.DataFrame

In [16]:
b["Students"] #yeh hmme as a series milin hai

A     inder
B     preet
C    preety
Name: Students, dtype: object

In [17]:
type(b["Students"])

pandas.core.series.Series

### Multiple Series

In [21]:
names = ['Inder','preet','preety']
marks = [50,20,60]

In [23]:
pd.DataFrame([names,marks])

       0      1       2
0  Inder  preet  preety
1     50     20      60

In [24]:
pd.DataFrame(names , marks)

         0
50   Inder
20   preet
60  preety

In [28]:
row1 =["Inder" , 20 , "Data Scientist" , 90.4]
row2 =["preet" , 20 , "Data Scientist" , 98.4]
row3 =["preety" , 25 , "Professor" , 89.4]

In [31]:
a =[row1 , row2 ,  row3]

In [32]:
b =np.array([row1 , row2 ,  row3])

In [37]:
#series
a

[['Inder', 20, 'Data Scientist', 90.4],
 ['preet', 20, 'Data Scientist', 98.4],
 ['preety', 25, 'Professor', 89.4]]

In [38]:
#numpy array
b

array([['Inder', '20', 'Data Scientist', '90.4'],
       ['preet', '20', 'Data Scientist', '98.4'],
       ['preety', '25', 'Professor', '89.4']], dtype='<U32')

In [39]:
#dataframe in table form
pd.DataFrame(a)

        0   1               2     3
0   Inder  20  Data Scientist  90.4
1   preet  20  Data Scientist  98.4
2  preety  25       Professor  89.4

In [40]:
pd.DataFrame(b)

        0   1               2     3
0   Inder  20  Data Scientist  90.4
1   preet  20  Data Scientist  98.4
2  preety  25       Professor  89.4

In [41]:
indexes = "A B C".split()

In [43]:
columns = "Name age work marks".split()

In [45]:
df = pd.DataFrame(a,index = indexes,columns = columns)

In [46]:
df

     Name  age            work  marks
A   Inder   20  Data Scientist   90.4
B   preet   20  Data Scientist   98.4
C  preety   25       Professor   89.4

In [47]:
print(df)

     Name  age            work  marks
A   Inder   20  Data Scientist   90.4
B   preet   20  Data Scientist   98.4
C  preety   25       Professor   89.4

### Putting data Through dictionary

dictionary me data column wise jata hai always remember

In [54]:
d = {
    1:["inder" , 28 , "netmax" , 63.5],
    2:["preet" , 25 , "dev" , 65.8],
    3:["preety" , 20 , "data" , 73.1]

}

In [55]:
d

{1: ['inder', 28, 'netmax', 63.5],
 2: ['preet', 25, 'dev', 65.8],
 3: ['preety', 20, 'data', 73.1]}

In [56]:
pd.DataFrame(d)

        1      2       3
0   inder  preet  preety
1      28     25      20
2  netmax    dev    data
3    63.5   65.8    73.1

In [59]:
d = {
    "name":["inder" , "preet", "preety"],
    "age":[20 , 25 , 27 ],
    "weights":[56.5,65, 73.1]

}

In [60]:
pd.DataFrame(d)

     name  age  weights
0   inder   20     56.5
1   preet   25     65.0
2  preety   27     73.1

In [61]:
pd.DataFrame(d , index=range(1,4))

     name  age  weights
1   inder   20     56.5
2   preet   25     65.0
3  preety   27     73.1

In [63]:
pd.DataFrame(d , index=range(100,103))

       name  age  weights
100   inder   20     56.5
101   preet   25     65.0
102  preety   27     73.1

## Reading Files